## ✅ Terraform Plan successful
#### Terraform Plan Output
<details>
<summary>Show Output</summary>

```
aws_sqs_queue.unprocessed_data_queue_deadletter: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/unprocessed-data-deadletter-queue]
aws_iam_role.lambda_role: Refreshing state... [id=lambda_processor_role]
data.aws_caller_identity.current: Reading...
aws_dynamodb_table.processed_data: Refreshing state... [id=processed-data]
aws_sns_topic.notifications: Refreshing state... [id=arn:aws:sns:us-east-1:886360753244:data-processed-topic]
aws_s3_bucket.data_bucket: Refreshing state... [id=serverless-arch-data-bucket]
aws_s3_bucket.lambda_bucket: Refreshing state... [id=serverless-arch-lambda-bucket]
data.aws_caller_identity.current: Read complete after 0s [id=886360753244]
aws_sqs_queue.processing_queue: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue]
aws_sqs_queue_redrive_allow_policy.unprocessed_data_redrive_allow_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/unprocessed-data-deadletter-queue]
aws_sns_topic_subscription.sns_to_sqs_sub: Refreshing state... [id=arn:aws:sns:us-east-1:886360753244:data-processed-topic:3b34f14f-00a8-4c8f-8814-9ed86444c61b]
data.aws_iam_policy_document.sqs_policy: Reading...
data.aws_iam_policy_document.sqs_policy: Read complete after 0s [id=963451197]
aws_sqs_queue_policy.queue_policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/886360753244/data-processed-queue]
aws_iam_policy.processor_policy: Refreshing state... [id=arn:aws:iam::886360753244:policy/ProcessorPolicy]
aws_iam_role_policy_attachment.lambda_attach: Refreshing state... [id=lambda_processor_role/arn:aws:iam::886360753244:policy/ProcessorPolicy]
aws_iam_policy.uploader_policy: Refreshing state... [id=arn:aws:iam::886360753244:policy/UploaderPolicy]
aws_lambda_function.processor: Refreshing state... [id=process-uploaded-file]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # aws_lambda_function.processor has been deleted
  - resource "aws_lambda_function" "processor" {
      - arn                            = "arn:aws:lambda:us-east-1:886360753244:function:process-uploaded-file" -> null
      - function_name                  = "process-uploaded-file" -> null
        id                             = "process-uploaded-file"
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_policy.lambda_code_s3_access will be created
  + resource "aws_iam_policy" "lambda_code_s3_access" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "LambdaCodeS3AccessPolicy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:GetObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::serverless-arch-lambda-bucket/lambda/function.zip"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_code_s3_attach will be created
  + resource "aws_iam_role_policy_attachment" "lambda_code_s3_attach" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "lambda_processor_role"
    }

  # aws_lambda_function.processor will be created
  + resource "aws_lambda_function" "processor" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "process-uploaded-file"
      + handler                        = "main.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "us-east-1"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::886360753244:role/lambda_processor_role"
      + runtime                        = "python3.11"
      + s3_bucket                      = "serverless-arch-lambda-bucket"
      + s3_key                         = "lambda/function.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 10
      + version                        = (known after apply)

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_permission.allow_s3 will be created
  + resource "aws_lambda_permission" "allow_s3" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "process-uploaded-file"
      + id                  = (known after apply)
      + principal           = "s3.amazonaws.com"
      + region              = "us-east-1"
      + source_arn          = "arn:aws:s3:::serverless-arch-data-bucket"
      + statement_id        = "AllowExecutionFromS3"
      + statement_id_prefix = (known after apply)
    }

  # aws_s3_bucket_notification.bucket_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_notification" {
      + bucket      = "serverless-arch-data-bucket"
      + eventbridge = false
      + id          = (known after apply)
      + region      = "us-east-1"

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:*",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

Plan: 5 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
```
</details>